{
    "tier1works": [
        {
            "title": "Mobile Roguelike",
            "year": "2019",
            "preview": "src/assets/img/previews/mobileroguelike.png",
            "platform": "Soon on Android",
            "builtWith": "Unity",
            "context": "Game in Development for Fourth Dimension",
            "contentImage": "src/assets/img/content/mobileroguelike.png",
            "description": "<p>Mobile Roguelike is the temporary name of this project. This one is built on the Level Generation System and Turn Based System I built for Dreamlands. As the name implies it is a traditional and simple roguelike experience for mobile devices. I want to focus on how fun it is to move the character and engage in combat.</p><p>This is, right now, the biggest project I've ever worked on for Fourth Dimension Studio and I'm really proud of the result I'm getting so far. I've been focusing on System Design and Gameplay Programming, but soon focus will shift into aesthetic, art and music production. I'm studying the possibility of having a partnership with the concept art and in game art (probably will happen) and I'm still studying the possibility of having someone help me with Sound Design and Music Production, these are topics I enjoy a lot, but I do not have much experience with them at the moment.</p><p>I spent extra time and effort on the Level Generation System for this game and actually published it on the Asset Store! I know it solves a really specific problem but I think it is a highly valuable system which could help a lot of developers.",
            "links": [
                { 
                    "url": "https://fourthdimension.itch.io/mobile-roguelike",
                    "label": "Play demo on itch.io" 
                },
                {
                    "url": "https://assetstore.unity.com/packages/templates/systems/customizable-dungeon-generator-140908",
                    "label": "Dugeon Generator on Asset Store"
                }
            ]
        },
        {
            "title": "Freshman's Quest",
            "year": "2019",
            "preview": "src/assets/img/previews/freshmansquest.png",
            "platform": "Soon on PC",
            "builtWith": "Unity",
            "context": "Game in Development for UFU Games",
            "contentImage": "src/assets/img/content/freshmansquest.png",
            "description": "<p>Freshman's Quest is a pixel platformer game that takes place at an University/Fantasy mixed Universe!</p><p>You will take control of Lily, a Philosophy Undergraduate student with a big sense of pride trying not to fail her final exams. It all takes place in a fast paced, challenging, fluid and hand crafted platformer game with intriguing characters and memorable plot! All of that in an universe with 16bit aesthetics. </p><ul><li>It is a narrative driven, single player adventure that places in an university and is written by university students!</li><li>Challenging hand crafted levels that represents a range of university courses!</li><li>Simple and accessible controls, jump and wall jump!</li><li>Lightning fast respawn so you learn faster and jump (literally) right back into action!</li><li>Pizza</li></ul><p>We currently go under the name of UFU Games, the team was born under a project run by a local indie game studio called GILP. This project was focused on introducing and building game developers, this team and this game is the result of the first iteration of this project.</p><p>Freshman's Quest currently is developed by 8 people, 3 programmers, 2 artists, 1 designer and 1 musician, these roles can change from time and according to necessity (just indie development stuff).</p>",
            "links": [
                { 
                    "url": "http://freshmansquest.com",
                    "label": "Press Page" 
                },
                {
                    "url": "https://twitter.com/FreshmansQuest",
                    "label": "Twitter"
                }
            ]
        },
        {
            "title": "Upside Down",
            "year": "2019",
            "preview": "src/assets/img/previews/upsidedown.png",
            "platform": "Android, soon on iOS",
            "builtWith": "Unity",
            "context": "Partnership with GILP Studio",
            "contentImage": "src/assets/img/content/upsidedown.png",
            "description": "<p>Upside Down is a simple and casual Android game developed by GILP Studio. It features a double sided world where gravity changes its direction whether you are Up or Down, this variation provides emergent complexity with just the jumping action. Although casual, it is quite challenging as it is difficult to time correctly all the jumps and get all the souls at the same time!</p><p>This project was developed and released in 2017, on early 2019 I was invited to join as an intern and work on some updates on this game, as the company is focused on other projects at the moment.</p><p>Me and other intern worked on the following tasks:</p><ul><li>Updating project version from Unity 2017.1 to 2017.4 (LTS)</li><li>Updating all dependencies on the project: Google Play Services for Unity, Firebase and Google AdMob.</li><li>Performance Optimization (Average FPS went from ~25 to ~40) by upgrading the components and optimizing UI.</li><li>Added Colorbling mode.</li><li>Added some polish/juice on the interface and improved music transition on pause/losing the game.</li><li>UI Bug Fixes</li><li>iOS Port (In Progress)</li></ul><p>A lot of these tasks are more related to the technology stack and not to game design or game programming directly, but I got a lot of experience on these tools and all the stuff that exists around a game. A lot of times these things are taken for granted (and I'm guilty of that also) but overall they help a lot on the final experience the player has.</p>",
            "links": [
                { 
                    "url": "http://www.gilp.studio",
                    "label": "GILP Studio" 
                },
                {
                    "url": "https://play.google.com/store/apps/details?id=studio.gilp.upsidedown&hl=en",
                    "label": "Download on Play Store"
                }
            ]
        },
        {
            "title": "happily(never)after",
            "year": "2018",
            "preview": "src/assets/img/previews2/happilyneverafter.png",
            "platform": "HTML5, Windows and Mac",
            "builtWith": "Unity",
            "context": "Game Jam",
            "description": "<p>happily(never)after is a platformer game made as an entry for Weekly Game Jam 76, where the theme was Afterlife. It is my fourth platformer in a row and it is build on the successes and failures of the previous ones and having Celeste as the main inspiration. The biggest goal is for the game to be enjoyable solely by the gameplay itself.</p> <p>You can play it in the WebGL version. There is also the option of downloading for Windows or Mac OS X, feel free to leave any comments! The game source code can be found on GitHub.</p>",
            "links": [
                { 
                    "url": "https://gueepo.itch.io/happilyneverafter",
                    "label": "Play on itch.io" 
                },
                {
                    "url": "https://github.com/guilhermepo2/wgj76",
                    "label": "Source Code"
                }
            ]
        }
    ],
    "tier2works": [
        {
            "title": "Journey to the Light",
            "year": "2018",
            "preview": "src/assets/img/previews/journeytothelight.png",
            "platform": "HTML5",
            "builtWith": "Unity",
            "context": "Game Jam",
            "description": "<p>Jimjam is a Gamejam hosted by Game Development Underground's host Tim Ruswick. The theme of this particular one was Ouroboros. I was into platformers and developed a simple platformer with action mechanics added and a very simple yet complete story on top.</p>",
            "links": [
                {
                    "url": "https://gueepo.itch.io/light-journey",
                    "label": "Play on itch.io"
                },
                {
                    "url": "https://github.com/guilhermepo2/jimjam2",
                    "label": "Source Code"
                }
            ]
        },
        {
            "title": "Pizza Clicker",
            "year": "2018",
           "preview": "src/assets/img/previews/pizzaclicker-mobile.png",
           "platform": "Android",
            "builtWith": "Unity",
            "context": "Released Game for Fourth Dimension",
           "description": "<p>Pizza Clicker is a really simple idle/clicker game. You just opened your own pizzeria and you have to click to produce pizza! With pizza you can hire Gennaros to help you or buy Ovens to help you produce even more pizzas, while you do that, there's a local newspaper telling your progress!</p><p>This was the second game I made for Fourth Dimension Studio, I still intend to spend some time on it adding updates and pushing the concept forward, but it's difficult with so much stuff happening right now.</p>",
           "links": [
               {
                   "url": "https://play.google.com/store/apps/details?id=com.FourthDimensionStudios.PizzaClicker",
                   "label": "Download on Play Store"
               },
               {
                   "url": "http://fourthdimension.studio/pizzaclicker/",
                   "label": "Landing Page (with Press Kit)"
               }
           ]
        },
        {
            "title": "Dreamlands",
            "year": "2018",
           "preview": "src/assets/img/previews2/dreamlands.png",
           "platform": "HTML5",
            "builtWith": "Unity",
            "context": "Postponed game for Fourth Dimension",
           "description": "<p>Dreamlands was a project I was working on. It is a roguelike based on the tradition of the genre, inspired mainly by Crypt of the Necrodancer and Bloodborne. The goal is to be an intro to roguelikes, as classic roguelikes are hard to get into. To do that Dreamlands will be more simple than others and more aesthetically pleasing.</p><p>The game was postponed as I was working on other projects at the time and because the project lacked a clear vision on design and aesthetic goals. I wanted for it to have RPG stats attributes but its balance would lead to an overwhelming development time and probably to an overwhelming experience.</p><p>I focused on developing the Level Generation System and the Turn Based Combat System, both of them I'm using on my current project, entitled Mobile Roguelike. For now, Dreamlands is something I'm not working on anymore.</p>",
           "links": [
               {
                   "url": "https://fourthdimension.itch.io/dreamlands",
                   "label": "Play Demo on itch.io"
               },
               {
                   "url": "https://fourthdimension.studio/devlog/",
                   "label": "Fourth Dimension Studio Devlog"
               }
           ]
        }
    ],
   "tier3works": [
        {
            "title": "Space Journey",
            "year": "2018",
            "preview": "src/assets/img/previews/spacejourney.png",
            "platform": "Android",
            "builtWith": "Unity",
            "context": "Released game for Fourth Dimension",
            "description": "<p>Space Journey is a simple casual game based on the famous Flappy Bird, but space themed. You have to tap to help the space core avoid the obstacles, which are satellites, and enjoy its journey through space.</p><p>A point of difference that makes Space Journey not just another Flappy Bird clone is that I wanted a different feel with it, as it takes place on space I wanted more of a 'floaty' feel. I did that by making movements slower, gravity weaker and tried to used sound effects on a lower frequency.</p><p>Space Journey was the first game I developed for Fourth Dimension Studio, it was solely developed by me.</p>",
            "links": [
                {
                    "url": "https://play.google.com/store/apps/details?id=com.FourthDimension.SpaceJourney",
                    "label": "Download"
                },
                {
                    "url": "https://fourthdimension.studio/spacejourney/",
                    "label": "Landing Page (with Press Kit)"
                }, 
                {
                    "url": "https://fourthdimension.studio/devlog/2018-08-07-Space-Journey/",
                    "label": "Postmortem"
                }
            ]
        },
        {
            "title": "Secludere",
            "year": "2018",
            "preview": "src/assets/img/previews/secludere.png",
            "platform": "HTML5",
            "builtWith": "Unity",
            "context": "Game Jam",
            "description": "<p>Secludere was my entry for the Become Better at Something Jam, the goal was to practice and improve on animation and music production.</p>",
            "links": [
                {
                    "url": "https://gueepo.itch.io/secludere",
                    "label": "Play it"
                },
                {
                    "url": "https://gueepo.itch.io/secludere/devlog/49559/secludere-postmortem",
                    "label": "Postmortem"
                },
                {
                    "url": "https://github.com/guilhermepo2/becomeBetterJam",
                    "label": "Source Code"
                }
            ]
        },
        {
            "title": "Cult Cultivation",
            "year": "2019",
            "preview": "src/assets/img/previews2/cult2.png",
            "platform": "HTML5",
            "builtWith": "Unity",
            "context": "Game Jam",
            "description": "<p>A very simple incremental game for the Weekly Game Jam 78, where the theme was Grow. The idea is to grow your own cult to a Cosmic Entity! It is a base for an Incremental Game Framework I'm working for Unity.</p>",
            "links": [
                {
                    "url": "https://gueepo.itch.io/cult-cultivation",
                    "label": "Play on itch.io"
                }
            ]
        },
        {
            "title": "Game Development Club",
            "year": "2018",
            "preview": "src/assets/img/previews/gamedevclub.png",
            "platform": "Nowhere",
            "builtWith": "Unity",
            "context": "Different prototypes developed on a local game dev club",
            "description": "<p>We are a Game Development Club where students from dfferent courses on Federal University of Uberlandia studying together about game development. The goal is to create a full game until the end of the year, so we made many prototypes to try a lot of different things.</p><p>Four Prototypes Were Made: an action platformer with visual novel (dialogue) additions, a mobile racing game, a puzzle game and a small world mechanic.</p><p>My Contributions: The puzzle game and small world mechanics were solely made by me, the idea was to fast prototype a mechanic to see whether it was fun or not (it wasn't), they didn't take more than 30 minutes each one. </p> <p>On the action platformer game I programmed the dialogue system and on the mobile racing I programmed the car controller (with gyroscope) and the camera.</p>"
        },
        {
            "title": "Puzzle Game",
            "year": "2018",
            "preview": "src/assets/img/previews/m3rl.png",
            "platform": "Windows and Mac",
            "builtWith": "GameMaker Studio 2",
            "context": "Postponed Game for Fourth Dimension",
            "description": "<p>This Puzzle Game, which I'm calling temporarily of Match 3 Roguelike is, well, as the name says, a Match 3 style game with some elements of Roguelike. It is heavily inspired by games such as Panel de Pon, Tetris Attack and Pokemon Puzzle Challenge.</p><p>The game was being developed on GameMaker Studio but I stoped its development because the system programming was quite complex for this engine, so I decided to get back to Unity for this game. One thing led to another and I stoped working on this game.",
            "links": [
                {
                    "url": "https://gueepo.itch.io/puzzle-game",
                    "label": "Download on itch.io"
                }
            ]
        },
        {
            "title": "Tetris Clone",
            "year": "2018",
            "preview": "src/assets/img/previews/tetris-pc.png",
            "platform": "HTML5 and Android",
            "builtWith": "Unity",
            "context": "Learning Project",
            "description": "<p>This is a Tetris Clone project developed for Web and Mobile on Unity, I did its Programming. This tetris implementation was based on the Udemy Course 'Make a Tetris-style puzzler in Unity' by Walmer Lin with some subtle changes.</p><p>Changes includes gameplay elements such as button pressing delay (and whether they exist or not), order of input processing (player input, piece drop, check game over, etc...), I removed the 'Hold' functionality and, originally, the queue had 3 pieces, I changed it to have just one.</p><p>This was mostly a learning project to check if my guesses on how to write a tetris were correct and it was useful to get some practice on my weak points in Unity such as User Interface and Particles.</p>",
            "links": [
                {
                    "url": "https://gueepo.itch.io/tetrisclone",
                    "label": "Play on itch.io"
                }, {
                    "url": "https://gueepo.itch.io/tetrisclone/devlog/41146/first-devlog",
                    "label": "Postmortem"
                }
            ]
        },
        {
            "title": "Zombies on the Basement",
            "year": "2018",
            "preview": "src/assets/img/previews/zombie-roguelike.png",
            "platform": "Windows",
            "builtWith": "GameMaker Studio 2",
            "context": "Game Jam",
            "description": "<p>his is a Roguelike game and my entry for the Hearthjam, promoted by Heartbeast where the theme was Scarcity.</p>",
            "links": [
                {
                    "url": "https://gueepo.itch.io/zombies-on-the-basement",
                    "label": "Download on itch.io"
                }
            ]
        },
        {
            "title": "Newtons Laws of Roguelike",
            "year": "2018",
            "preview": "src/assets/img/previews/newton-roguelike.png",
            "platform": "Windows",
            "builtWith": "GameMaker Studio 1.4",
            "context": "Game Jam",
            "description": "<p>This is a Roguelike game and my entry for the GameMaker Community Jam 7 where the theme was Newton's Laws of Motion.</p>",
            "links": [
                { 
                    "url": "https://gueepo.itch.io/gmc7",
                    "label": "Download on itch.io"
                }
            ]
        },
        {
            "title": "Pizza Clicker",
            "year": "2018",
            "preview": "src/assets/img/previews/pizzaclicker.png",
            "platform": "HTML5",
            "builtWith": "Phaser",
            "context": "Unfinished Game",
            "description": "<p>Pizza Clicker is a simple clicker/idle game where you click to earn pizza and spend pizza to earn more pizza, the perfect addiction formula</p>",
            "links": [
                { 
                    "url": "http://gueepo.me/pizzaclicker/",
                    "label": "Play it here"
                }
            ]
        },
        {
            "title": "Midnight Journey",
            "year": "2017",
            "preview": "src/assets/img/previews/midnight-journey.png",
            "platform": "Nowhere",
            "builtWith": "Unity",
            "context": "Canceled Game",
            "description": "<p>I always had this idea of developing a game all by myself, programming, art and sound. Not only that, with this idea I wanted to blog or vlog about it, this year I decided that I would start this project of mine and until the writing of this page, I have a small alpha of how I want the game to be, I will provide a small story on how things went so far. At this present moment I am writing a game design document for this game so I can better think through it and make better decisions</p><br><h2>Zelda Souls</h2><h4><a href='https://gueepo.wordpress.com/2017/01/24/zelda-souls/'>First Post - Zelda Souls? (2017/01/24)</a></h4><p>This was the first post on my blog where I talk about this idea, at first I was calling the game 'Zelda Souls' because I wanted a mixed feeling of Souls Games and Zelda Games, but in fact, after some time I realized that Souls' Games (Dark Souls, Bloodborne, ...) <strong>are</strong> 'Zelda Souls' and Zelda is also 'Zelda Souls'... at least I think this way.</p><p>Then I talked about some insights of what I wanted, what I was going to do and technologies, nothing special.</p><br><h4><a href='https://gueepo.wordpress.com/2017/02/07/titan-souls-impressions/'>Second Post - Titans Souls Impressions (2016/02/07)</a></h4><p>After some time I saw this game, <strong>Titan Souls</strong> and it was really an inspiration to me, click on the link above to see an analysis that I've made of the game.</p><br><h4><a href='https://gueepo.wordpress.com/2017/02/08/zelda-souls-mechanics-update-and-minimum-viable-product/'>Third Post - Zelda Souls Mechanics and Minibum Viable Product (2017/02/08)</a></h4><p>This is the post where I talk about some of the first mechanics I wanted and describe the minimum viable product for this, basically a battle system similar to Zelda, yay.</p><br><h4><a href='https://gueepo.wordpress.com/2017/03/06/assets-development/'>Fourth Post - Assets Development (2017/03/06)</a></h4><p>In this one I describe some of the assets that I have to develop in Unity for my game</p><br><h4><a href='https://gueepo.wordpress.com/2017/03/29/inverted-pyramid-in-game-development/'>Fifth Post - Inverted Pyramid in Game Dev (2017/03/29)</a></h4><p>Here I talk about something called 'Inverted Pyramid', I've seen it in a Brazilian blog and I really liked the idea, it talks about how to break your game into pieces where every piece is a finished and complete game, so you start with the smaller piece and start iterating over it.</p><br><h4><a href='https://gueepo.wordpress.com/2017/04/02/monthly-update-3/'>Sixth Post - Monthly Update and First Results (2017/04/02)</a></h4><p>This is where I started to get my first results on actually doing something. I even tried to record a small video of me explaining what I did, anyway, in this post I talk about the first prototype of Zelda Souls, that is the Battle System. You can see the video below:</p><br><br><div class='video'><iframe width='420' height='345' src='https://www.youtube.com/embed/4CDPPPanflA'></iframe></div><br><p>On the post I also talk about the next steps I should take. and <a href='https://gueepo.wordpress.com/2017/04/10/decisions-decision/'> on this one</a> I talk more about some decisions I've made for the game</p><br><h2>Midnight Journey, not Zelda Souls</h2><p>My University had some kind of a 'Showcase' of student's projects, it was announced and I thought it was a good opportunity to show this game I was doing. I also decided to name it 'Midnight Journey', no more Zelda Souls!</p><p><a href='https://gueepo.wordpress.com/2017/04/13/zelda-souls-first-demonstration/'>Here</a> is where I talk about this first demonstration, how I want it to be and talk about some other random stuff. <a href='https://gueepo.wordpress.com/2017/04/15/assets-for-midnight-journey/'>And here</a> is where I talk about what assets I will need to develop for this first demonstration</p><h4><a href='https://gueepo.wordpress.com/2017/05/'>Seventh Post - Monthly Update (2017/05/14)</a></h4><p>This post is where I show how the Alpha Version of Midnight Journey is, you can watch it below:</p><div class='video'><iframe width='420' height='345' src='https://www.youtube.com/embed/nGrTwX7sdd0'></iframe></div><br><p>The result was way less than what I really wanted to do, but giving the deadline and everything else that is what I was capable of doing, I'm really proud of that, and then... I talk about what to do next, some thoughts and these stuff that I've been talking about since January</p><p>As you can see, I had the Midnight Journey Alpha with my programming and my art! It is really cool, there is also an intro music that I composed, based on others famous one... I didn't have the time to compose a background music for the game itself, anyway, you can listen the Prelude music below:</p><div class='video'><iframe width='100%' height='166' scrolling='no' frameborder='no' src='https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/317600878&amp;color=ff5500&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false'></iframe></div> <br><h4><a href='https://gueepo.wordpress.com/2017/06/06/monthly-update-5-life-and-also-oh-no-not-again/'>Eighth Post - Monthly Update and Midnight Journey Nowadays</a></h4><p>On the post I do some basic math and get to the conclusion that I won't have the time do to everyting that I want to do for this game, so, <strong>from now on</strong> I will write a game design document of what exactly I want it to be and then I wil do some thinking of what to do with Midnight Journey</p><p>So that's what I am doing at this present moment, writing the Game Design Document for Midnight Journey and also working on small game ideas and old ideas prototypes! Midnight Journey is a too complicated for me right now, but I am totally able to write the Game Design Document and then simplify it or make a better strategy on how to achieve the game I want to make.</p><p>You can see what I am doing on my <a href='https://gueepo.wordpress.com'>blog</a>, I post <em>at least</em> once a month, usually I post more than that. You can always reach me on twitter or by email, they are available on <a href='http://guilhermepo2.github.io'>my website</a>!</p><p>Hope you enjoyed the idea and what I have on this game!</p>"
        },
        {
            "title": "The Ace Programmer",
            "year": "2017",
            "preview": "src/assets/img/previews/ace-programmer.png",
            "platform": "Nowhere",
            "builtWith": "Unity",
            "context": "Prototype",
            "description": "<p>It is a Visual Novel Adventure Game, it would have a story, dialogues and a puzzle/adventure part where the puzzle would be related to computer programming.</p>"
        },
        {
            "title": "Inverse Kinomatics",
            "year": "2017",
            "preview": "src/assets/img/previews/inverse-kino.png",
            "platform": "Nowhere",
            "builtWith": "Unity",
            "context": "Learning Project",
            "description": "<div class='video'><iframe width='420' height='345' src='https://www.youtube.com/embed/q8x3mGB-s0w'></iframe></div></div><hr><p>If you want complete information on this, see my <a href='https://gueepo.wordpress.com/2017/08/06/monthly-update-7/'>monthly update</a> of when I did this.</p><p>For short, Inverse Kinomatics is a 2.5D 'game' that served me as a learning experience. I always had this project of doing something similar to this where I would work with Inverse Kinematics in Unity and mess up a little bit with shaders.</p><p>All the programming and 3D Models are my own. Rigging and Animations are from Mixamo.</p><p>Before doing this I thought doing it were going to be pretty straightforward, but I was wrong. Pushing, Pulling and Climbing Animations are something really hard to get done correctly and this is what went most wrong in this project. As you can see in the video, climbing terrain is done pretty much by teleporting the character at the end of the animation.</p><p>As a positive side, doing it I learned that Inverse Kinematics on Unity 3D is way easier than I thought it would be, and also I could see that with hard work and a little bit of experimentation I could do a custom shader to achieve a somehow unique aesthetic.</p><p>That's pretty much it for this one! If you like you can follow my <a href='https://gueepo.wordpress.com'>blog</a>, where I will be doing monthly updates on what I'm working on. You can also go to my <a href='http://guilhermepo2.github.io'>website</a> for more information about me and how to contact me.</p>"
        },
        {
            "title": "Ghost Game",
            "year": "2017",
            "preview": "src/assets/img/previews/ghost-game.png",
            "platform": "Nowhere",
            "builtWith": "Unity",
            "context": "Canceled Game",
            "description": "<p>Ghost Game is a puzzle platformer game, it would lie between a Mario and Limbo. The game consists of you having a physical and a ghost body, each one with their own capacities and you have to use both to solve puzzles.</p>",
            "links": [
                {
                    "url": "https://www.youtube.com/watch?v=Vu8Nw9p2S6k",
                    "label": "Gameplay Footage"
                }
            ]
        },
        {
            "title": "Jade Reno Pirates",
            "year": "2017",
            "preview": "src/assets/img/previews/jade-reno-pirates.png",
            "platform": "Nowhere",
            "builtWith": "Unity",
            "context": "Unfinished Game",
            "description": "<p>Jade Reno Pirates was a simple learning project, it is basically Rock Paper Scissors but with a Hearthstone thematic. During the expansion Mean Streets of Gadgetzan the meta felt pretty much like a Rock Paper Scissors game.</p>"
        },
        {
            "title": "BoxGuy",
            "year": "2016",
            "preview": "src/assets/img/previews/boxguy.png",
            "platform": "Android",
            "builtWith": "Unity",
            "context": "Learning Project",
            "description": "<p>A simple infinite runner game made with a friend as a learning exercise, it includes a simple UI, Google Play Leaderboards and Unity ADS.</p>"
        },
        {
            "title": "Olympic Runner",
            "year": "2016",
            "preview": "src/assets/img/previews/olympic-runner.png",
            "platform": "Android, Windows and Mac",
            "builtWith": "Unity",
            "context": "Game Jam",
            "description": "<p>A simple infinite runner game made with a friend to a local game competition in our university, with olympics theme.</p>"
        },
        {
            "title": "FACOM Souls",
            "year": "2015",
            "preview": "src/assets/img/previews/facom-souls.png",
            "platform": "Nowhere",
            "builtWith": "Unity",
            "context": "Learning Project",
            "description": "<div class='video'><iframe width='420' height='345' src='https://www.youtube.com/embed/cgFsdmuyYwE'></iframe></div></div><hr><p>FACOM Souls is a Dark Souls based combat system learning experience. I developed it on my 5th semester at University (Second Semester of 2015) as a final project for Object Oriented Programming 2.</p><p>The main character (Elite Knight) was modeled and textured by me, rigging and animations are from Mixamo, also, everything related to code is also my own.</p><p>The purpose of this essay was to develop <em>anything</em> using at least 5 design patterns. I've chosen to do this Dark Souls combat style because it was something that I've been wanting to do for some time.</p><p>I used the following Design Patterns: </p><p><strong>Strategy:</strong> The Strategy design pattern allows you to use different behaviours in a way that they can easily be changed. In this project it was used for the weapons, each weapon has its own damage and animations, and they can easily be changed using this design pattern.</p><p><strong>Mediator:</strong> The Mediator Design Pattern is useful to avoid objects referencing each other, they reference the mediator instead. It is used on the combat, instead of the player object checking for enemies, it just tells the mediators that he is attacking, the mediator does the rest.</p><p><strong>Memento:</strong> The Memento Design Patern is useful to take a 'picture' of the state of your program, so you can go back to that state at any given time. In this project it is used for the save game.</p><p><strong>Observer:</strong> Instead of the enemies always checking for the Elite Knight, our hero has a characteristic that warns the enemies when he is near them. This way the complexity of changing enemy behaviour according to the distance to the player is all on the main character (which is only one) and not on the enemies (which are many)</p><p><strong>State:</strong> The State Pattern makes automatic update of object behaviour, when an enemy's state changes, his behaviour also changes. The state can go from idle to alert and from alert to attacking, each one with its own set of behaviours.</p><p><strong>Singleton:</strong> The Singleton Design Pattern ensures that a class will have only instance and that instance is accessible anywhere. This one is used on the User Interface and on the Mediator. Because there is only one User Interface and Mediator. The Main Character just gives a call to the singleton and the UI adapts or the Mediator acts.</p><p>That's pretty much it for <strong>FACOM Souls</strong>! If you like you can follow my <a href='https://gueepo.wordpress.com'>blog</a>, where I will be doing monthly updates on what I'm working on. You can also go to my <a href='http://guilhermepo2.github.io'>website</a> for more information about me and how to contact me.</p>"
        }
   ]
}